{
    "sidebar-home": "Inicio",
    "sidebar-portfolio": "Portfolio",
    "sidebar-about": "Sobre Mi",
    "sidebar-contact": "Contacto",
    
    "header-subtitle": "Desarrollador Web y de Videojuegos.",
    "download-cv": "Descargar CV",

    "learn-more": "Más información",
    "visit-site": "Visitar Web",
    "konecta-text": "Este proyecto lo realicé junto con mi grupo durante el Curso de Desarrollo Web. El front-end se realizó en React y el back-end con Spring Boot, utilizando AWS para nuestros servidores, bases de datos y almacenamiento.",
    "portfolio-text": "Este es mi propio portfolio, fue hecho con React, usando algunos templates de W3Schools y Bootstrap, poniendo en práctica mis habilidades en HTML, CSS, JS y Bootstrap. He utilizado Hostinger para alojar mi sitio web.",
    "photography-text": "Este proyecto fue hecho para un amigo que es fotógrafo, básicamente es un portfolio de su trabajo. Lo he hecho con Wordpress y el complemento de Elementor, fue mi primer acercamiento a estas herramientas.",

    "about-first": "Mi nombre es Ignacio Albiol, soy desarrollador web y de videojuegos, y vivo en Barcelona. Durante los últimos años he atravesado un proceso de reconversión profesional, pasando desde el sector educativo hacia el mundo de la programación y desarrollo. Inicié mi camino aprendiendo Unity y C# de forma autodidacta, y luego consolidé mis habilidades con una formación integral en desarrollo de aplicaciones web full-stack.",
    "about-second": "En cuanto a mis habilidades interpersonales, me considero una persona seria, responsable, decidida y trabajadora. Me gusta sumergirme en proyectos diversos, y he aprendido a trabajar en equipo de manera efectiva, extrayendo lo mejor de la colaboración con mis compañeros. Además, soy paciente y resiliente, cualidades clave en el mundo del desarrollo, y que he perfeccionado a lo largo de mi trayectoria profesional como educador.",
    "about-third": "Actualmente, me encuentro comprometido con el continuo crecimiento y aprendizaje en estas apasionantes áreas. Emocionado por el futuro, y listo para aportar mi experiencia en el desarrollo de nuevos proyectos.",

    "my-skills": "Mis Habilidades",
    "game-dev": "Desarrollo de Videojuegos",
    "web-design": "Diseño Web",
    "other": "Otras Habilidades",

    "contact-me": "Contáctame",
    "phone": "Teléfono",
    "get-in-touch": "Ponte en contacto. Envíame un mensaje:",
    "name": "Nombre",
    "email": "Email",
    "subject": "Asunto",
    "message": "Mensaje",
    "send-message": "Enviar Mensaje",

    "idea-title": "¿Cómo surgió la idea?",
    "idea-konecta-1": "K0N3CT4 surge como resultado del proyecto final grupal para el curso de Desarrollo Web que finalicé en noviembre del 2023. Fue desarrollado por mí y otras 3 personas, la idea general del proyecto surgió a partir de la consigna propuesta por nuestro profesor: ¿Cómo relacionar adolescentes y cultura?",
    "idea-konecta-2": "Esta pregunta nos ha llevado a pensar en diferentes formas de acercar la cultura a los adolescentes, teniendo en cuenta sus necesidades y restricciones. Es por esto que decidimos crear una aplicación específica para ellos, que sea práctica y sencilla, y en donde puedan encontrar eventos culturales del “underground” que sean gratuitos.",
    "idea-konecta-3": "El proyecto recopilará información sobre estos eventos culturales y los mostrará en dos formatos, un listado con todos los detalles (descripción, tipo de evento, hora y lugar) y también en un mapa.",
    "idea-konecta-4": "Tanto el listado como el mapa, permiten a los usuarios filtrar el contenido para encontrar de forma rápida el tipo de evento que se adapta a sus necesidades. Estos filtros se podrán personalizar al crear un usuario completando los campos de intereses.",
    "idea-konecta-5": "A su vez, los usuarios podrán interactuar entre sí, ver los eventos a los que asisten sus amigos y desbloquear recompensas por participar en la comunidad, comentando y calificando los eventos a los que han asistido.",
    
    "how-title": "¿Cómo se llevó a cabo el proyecto?",
    "how-konecta-1": "En cuanto al proceso de desarrollo, lo primero que hemos hecho ha sido realizar un bosquejo LO-FI en Figma, tanto mobile como desktop, que luego se ha ido mejorando, agregando color y estilo.",
    "how-konecta-2": "Por otro lado, hemos utilizando Trello para administrar nuestro flujo de trabajo y repartir las tareas, y GitHub para ayudarnos a administrar, rastrear y controlar los cambios mientras desarrollábamos la aplicación.",
    "front-konecta-text": "Realizado en React, utilizando la librería Router para gestionar el tráfico de una página a la otra, y JavaScript como lenguaje principal para las funciones y componentes. Para el estilo se ha utilizado tanto CSS como Bootrsap, y para mejorar la responsividad, Media Queries. También hemos hecho mucho hincapié en que la aplicación sea accesible para todo tipo de usuarios, con un promedio de accesibilidad de un 98%. Para desplegarlo, hemos trasladado la build del proyecto a una instancia de EC2 de Amazon Web Services.",
    "back-konecta-text": "Hemos utilizado Spring Boot para nuestra API, y en dónde hemos creado nuestros controladores, entidades y repositorios. Una vez realizada y comprobada su funcionalidad, al igual que el front-end, la hemos trasladado a una instancia EC2 de AWS mediante Apache Tomcat en formato .war.",
    "data-base": "Base de Datos",
    "db-konecta-text": "La base de datos fue creada primero en formato .json y luego trasladada a un RDS en Amazon Web Services. La misma se depliega en la aplicación mediante un “fetch” y es la encargada de mostrarnos toda la información de cada evento.",

    "in-dev-konecta" : "Futuras Actualizaciones",
    "dev-konecta-text" : "El proyecto aún se encuentra en fase de desarrollo y cuenta con mucho potencial para agregar diferentes features. Estas son las funcionalidades que se agregarán próximamente:",
    "dev-konecta-item1" : "Pantalla de edición de perfil de usuario.",
    "dev-konecta-item2" : "Creación de perfil de Administrador de eventos.",
    "dev-konecta-item3" : "Mapa funcional.",
    "dev-konecta-item4" : "Posibilidad de que el usuario pueda marcar la asistencia a un evento, y que este aparezca en su perfil.",
    "dev-konecta-item5" : "Sistema de calificación para los eventos (like y dislike).",
    "dev-konecta-item6" : "Sistema de interacción entre usuarios.",
    "dev-konecta-item7" : "Sistema de recompensas por participación en la comunidad (Tokens).",

    "colaborators-konecta" : "Colaboradores:",

    "skills-used" : "Herramientas utilizadas:"
}