{
    "sidebar-home": "Inici",
    "sidebar-portfolio": "Portfoli",
    "sidebar-about": "Sobre Mi",
    "sidebar-contact": "Contacte",
    
    "header-subtitle": "Desenvolupador Web i de Videojocs.",
    "download-cv": "Descarrega CV",

    "learn-more": "Més informació",
    "visit-site": "Visita la Web",
    "konecta-text": "Aquest projecte ho vam fer conjuntament amb el meu grup al Curs de Desenvolupament Web. Pel front-end es fa servir React i pel back-end Spring Boot, utilitzant AWS per als nostres servidors.",
    "portfolio-text": "Aquest és el meu propi portfoli, està fet amb React, utilitzant alguns templates de W3Schools i Bootstrap, posant en pràctica les meves habilitats en HTML, CSS, JS i Bootstrap.",
    "photography-text": "Aquest projecte ho vaig fer per a un amic fotògraf, bàsicament és un portfoli de la seva feina. Està fet amb Wordpress i el complement Elementor, va ser el meu primer apropament a aquestes eines.",

    "about-first": "Em dic Ignacio Albiol, sóc desenvolupador web i de videojocs, i visc a Barcelona. Durant els darrers anys he travessat per un procés de reconversió professional, passant del sector educatiu al de programació i desenvolupament. Al principi, vaig començar aprenent Unity i C# pel meu compte, i posteriorment vaig fer un curs intensiu de desenvolupament d'aplicacions web amb perfil full-stack. Actualment estic fent els meus primers passos al mercat, disposat a seguir aprenent i millorant els meus coneixements en aquestes àrees.",
    "about-second": "Pel que fa a les meves habilitats interpersonals, em considero una persona seriosa, responsable, decidida i treballadora. Gaudeixo aprenent de diferents projectes i tinc molt bona capacitat per treballar en equip i aprendre dels meus companys de feina. Sóc resilient, tinc molta paciència i sóc resolutiu per naturalesa.",

    "my-skills": "Les Meves Habilitats",
    "game-dev": "Desenvolupament de Videojocs",
    "web-design": "Disseny Web",
    "other": "Altres Habilitats",

    "contact-me": "Contacta'm",
    "phone": "Telèfon",
    "get-in-touch": "Posa't en contacte. Envia'm un missatge:",
    "name": "Nombre",
    "email": "Email",
    "subject": "Assumpte",
    "message": "Missatge",
    "send-message": "Envia Missatge",

    "idea-title": "Com va sorgir la idea?",
    "idea-konecta-1": "K0N3CT4 sorgeix com a resultat del projecte final grupal per al curs de Desenvolupament Web que vaig finalitzar el novembre del 2023. Va ser desenvolupat per mi i 3 persones més, la idea general del projecte va sorgir a partir de la consigna proposada pel nostre professor: Com relacionar adolescents i cultura?",
    "idea-konecta-2": "Aquesta pregunta ens ha portat a pensar en diferents maneres d'apropar la cultura als adolescents, tenint en compte les seves necessitats i restriccions. És per això que decidim crear una aplicació específica per a ells, que sigui pràctica i senzilla, i on puguin trobar esdeveniments culturals de l'underground que siguin gratuïts.",
    "idea-konecta-3": "El projecte recopilarà informació sobre aquests esdeveniments culturals i els mostrarà en dos formats, un llistat amb tots els detalls (descripció, tipus desdeveniment, hora i lloc) i també en un mapa.",
    "idea-konecta-4": "Tant el llistat com el mapa permeten als usuaris filtrar el contingut per trobar ràpidament el tipus d'esdeveniment que s'adapta a les vostres necessitats. Aquests filtres es podran personalitzar quan creeu un usuari completant els camps d'interessos.",
    "idea-konecta-5": "Al mateix temps, els usuaris podran interactuar entre ells, veure els esdeveniments als quals assisteixen els seus amics i desbloquejar recompenses per participar a la comunitat, comentant i qualificant els esdeveniments a què han assistit.",
    
    "how-title": "Com es va fer el projecte?",
    "how-konecta-1": "Pel que fa al procés de desenvolupament, el primer que hem fet ha estat fer un esbós LO-FI a Figma, tant mobile com desktop, que després s'ha anat millorant, afegint color i estil.",
    "how-konecta-2": "D'altra banda, hem utilitzat Trello per administrar el nostre flux de treball i repartir les tasques, i GitHub per ajudar-nos a administrar, rastrejar i controlar els canvis mentre desenvolupàvem l'aplicació.",
    "front-konecta-text": "Realitzat a React, utilitzant la llibreria Router per gestionar el trànsit d'una pàgina a l'altra, i JavaScript com a llenguatge principal per a les funcions i els components. Per a l'estil s'han utilitzat tant CSS com Bootrsap, i per millorar la responsivitat, Media Queries. També hem posat molt èmfasi que l'aplicació sigui accessible per a tota mena d'usuaris, amb una mitjana d'accessibilitat del 98%. Per desplegar-ho, hem traslladat la build del projecte a una instància d'EC2 d'Amazon Web Services.",
    "back-konecta-text": "Hem utilitzat Spring Boot per a la nostra API, i on hem creat els nostres controladors, entitats i repositoris. Un cop realitzada i comprovada la seva funcionalitat, igual que el front-end, l'hem traslladada a una instància EC2 d'AWS mitjançant Apache Tomcat en format .war.",
    "data-base": "Base de Dades",
    "db-konecta-text": "La base de dades va ser creada en principi en format .json i després traslladada a un RDS a Amazon Web Services. Aquesta es desplega a l'aplicació mitjançant un fetch i és l'encarregada de mostrar-nos tota la informació de cada esdeveniment.",

    "in-dev-konecta" : "Futures Actualitzacions",
    "dev-konecta-text" : "El projecte encara es troba en fase de desenvolupament i compta amb molt de potencial per agregar diferents features. Aquestes són les funcionalitats que s'afegiran properament:",
    "dev-konecta-item1" : "Pantalla d'edició de perfil d'usuari.",
    "dev-konecta-item2" : "Creació de perfil d'Administrador d'esdeveniments.",
    "dev-konecta-item3" : "Mapa funcional.",
    "dev-konecta-item4" : "Possibilitat que l'usuari pugui marcar l'assistència a un esdeveniment, i que aquest aparegui al seu perfil.",
    "dev-konecta-item5" : "Sistema de qualificació per als esdeveniments (like i dislike).",
    "dev-konecta-item6" : "Sistema de interacció entre usuaris.",
    "dev-konecta-item7" : "Sistema de recompenses per participació a la comunitat (Tokens).",

    "colaborators-konecta" : "Col·laboradors:",

    "skills-used" : "Eines utilitzades:"
}