{
    "sidebar-home": "Inici",
    "sidebar-portfolio": "Portfoli",
    "sidebar-about": "Sobre Mi",
    "sidebar-contact": "Contacte",
    
    "header-subtitle": "Desenvolupador Web i de Videojocs.",
    "download-cv": "Descarrega CV",

    "learn-more": "Més informació",
    "visit-site": "Visita la Web",
    "play-game" : "Jugar",
    "konecta-text": "Aquest projecte ho vam fer conjuntament amb el meu grup al Curs de Desenvolupament Web. Pel front-end es fa servir React i pel back-end Spring Boot, utilitzant AWS per als nostres servidors.",
    "portfolio-text": "Aquest és el meu propi portfoli, està fet amb React, utilitzant alguns templates de W3Schools i Bootstrap, posant en pràctica les meves habilitats en HTML, CSS, JS i Bootstrap.",
    "photography-text": "Aquest projecte ho vaig fer per a un amic fotògraf, bàsicament és un portfoli de la seva feina. Està fet amb Wordpress i el complement Elementor, va ser el meu primer apropament a aquestes eines.",
    "projectboost-text": "Un dels projectes pel curs de GameDev.tv Team. És un senzill joc on el jugador ha d'arribar a la plataforma de destinació enfrontant-se a diferents obstacles, com més ràpid ho faci, més punts sumarà.",

    "about-1": "Em dic Ignacio Albiol, soc desenvolupador web i de videojocs, i visc a Barcelona. Durant els últims anys he travessat un procés de reconversió professional, passant des del sector educatiu cap al món de la programació i desenvolupament. Vaig iniciar el meu camí aprenent Unity i C# de manera autodidacta, i després vaig consolidar les meves habilitats amb una formació integral en desenvolupament d'aplicacions web full-stack.",
    "about-2": "Pel que fa a les meves habilitats interpersonals, em considero una persona seriosa, responsable, decidida i treballadora. M'agrada submergir-me en projectes diversos, i he après a treballar en equip de manera efectiva, extraient el millor de la col·laboració amb els meus companys. A més, soc pacient i resilient, qualitats claus en món del desenvolupament, i que he perfeccionat al llarg de la meva trajectòria professional com a educador.",
    "about-3": "Actualment, estic compromès amb el creixement i aprenentatge continu en aquestes àrees apassionants. Emocionat pel futur i preparat per aportar la meva experiència en el desenvolupament de nous projectes.",

    "my-skills": "Les Meves Habilitats",
    "game-dev": "Desenvolupament de Videojocs",
    "web-design": "Disseny Web",
    "other": "Altres Habilitats",

    "contact-me": "Contacta'm",
    "phone": "Telèfon",
    "get-in-touch": "Posa't en contacte. Envia'm un missatge:",
    "name": "Nombre",
    "email": "Email",
    "subject": "Assumpte",
    "message": "Missatge",
    "send-message": "Envia Missatge",

    "idea-title": "Com va sorgir la idea?",
    "idea-konecta-1": "K0N3CT4 sorgeix com a resultat del projecte final grupal per al curs de Desenvolupament Web que vaig finalitzar el novembre del 2023. Va ser desenvolupat per mi i 3 persones més, la idea general del projecte va sorgir a partir de la consigna proposada pel nostre professor: Com relacionar adolescents i cultura?",
    "idea-konecta-2": "Aquesta pregunta ens ha portat a pensar en diferents maneres d'apropar la cultura als adolescents, tenint en compte les seves necessitats i restriccions. És per això que decidim crear una aplicació específica per a ells, que sigui pràctica i senzilla, i on puguin trobar esdeveniments culturals de l'underground que siguin gratuïts.",
    "idea-konecta-3": "El projecte recopilarà informació sobre aquests esdeveniments culturals i els mostrarà en dos formats, un llistat amb tots els detalls (descripció, tipus desdeveniment, hora i lloc) i també en un mapa.",
    "idea-konecta-4": "Tant el llistat com el mapa permeten als usuaris filtrar el contingut per trobar ràpidament el tipus d'esdeveniment que s'adapta a les vostres necessitats. Aquests filtres es podran personalitzar quan creeu un usuari completant els camps d'interessos.",
    "idea-konecta-5": "Al mateix temps, els usuaris podran interactuar entre ells, veure els esdeveniments als quals assisteixen els seus amics i desbloquejar recompenses per participar a la comunitat, comentant i qualificant els esdeveniments a què han assistit.",
    
    "how-title": "Com es va fer el projecte?",
    "how-konecta-1": "Pel que fa al procés de desenvolupament, el primer que hem fet ha estat fer un esbós LO-FI a Figma, tant mobile com desktop, que després s'ha anat millorant, afegint color i estil.",
    "how-konecta-2": "D'altra banda, hem utilitzat Trello per administrar el nostre flux de treball i repartir les tasques, i GitHub per ajudar-nos a administrar, rastrejar i controlar els canvis mentre desenvolupàvem l'aplicació.",
    "front-konecta-text": "Realitzat a React, utilitzant la llibreria Router per gestionar el trànsit d'una pàgina a l'altra, i JavaScript com a llenguatge principal per a les funcions i els components. Per a l'estil s'han utilitzat tant CSS com Bootrsap, i per millorar la responsivitat, Media Queries. També hem posat molt èmfasi que l'aplicació sigui accessible per a tota mena d'usuaris, amb una mitjana d'accessibilitat del 98%. Per desplegar-ho, hem traslladat la build del projecte a una instància d'EC2 d'Amazon Web Services.",
    "back-konecta-text": "Hem utilitzat Spring Boot per a la nostra API, i on hem creat els nostres controladors, entitats i repositoris. Un cop realitzada i comprovada la seva funcionalitat, igual que el front-end, l'hem traslladada a una instància EC2 d'AWS mitjançant Apache Tomcat en format .war.",
    "data-base": "Base de Dades",
    "db-konecta-text": "La base de dades va ser creada en principi en format .json i després traslladada a un RDS a Amazon Web Services. Aquesta es desplega a l'aplicació mitjançant un fetch i és l'encarregada de mostrar-nos tota la informació de cada esdeveniment.",

    "in-dev-konecta": "Futures Actualitzacions",
    "dev-konecta-text": "El projecte encara es troba en fase de desenvolupament i compta amb molt de potencial per agregar diferents features. Aquestes són les funcionalitats que s'afegiran properament:",
    "dev-konecta-item1": "Pantalla d'edició de perfil d'usuari.",
    "dev-konecta-item2": "Creació de perfil d'Administrador d'esdeveniments.",
    "dev-konecta-item3": "Mapa funcional.",
    "dev-konecta-item4": "Possibilitat que l'usuari pugui marcar l'assistència a un esdeveniment, i que aquest aparegui al seu perfil.",
    "dev-konecta-item5": "Sistema de qualificació per als esdeveniments (like i dislike).",
    "dev-konecta-item6": "Sistema de interacció entre usuaris.",
    "dev-konecta-item7": "Sistema de recompenses per participació a la comunitat (Tokens).",

    "colaborators-konecta": "Col·laboradors:",

    "skills-used": "Eines utilitzades:",

    "idea-laphoto-1": "Aquest projecte sorgeix arran de dos factors. Per una banda, les meves ganes de seguir aprenent i coneixent noves eines. D'altra banda, l'amistat, tinc un bon amic meu fotògraf, i que no tenia una pàgina web on ensenyar els seus treballs i projectes.",
    "idea-laphoto-2": "És per això que vaig decidir crear un portfoli de fotografia utilitzant WordPress i Elementor, perquè sigui fàcil d'utilitzar i mantenir-lo actualitzat, i sobretot perquè ell mateix pugui gestionar el contingut de la pàgina de forma senzilla.",
    "idea-laphoto-3": "Coneixent el material que té el meu amic, sabia que el portfoli necessitaria alguns apartats fonamentals, la possibilitat d'incloure fotografies, llibres en pdf i un projecte multimèdia. Per això vaig pensar que per a la pàgina principal el millor seria una galeria on es puguin veure fotografies destacades i al final, una secció on hi hagi un breu resum dels apartats esmentats anteriorment. D'altra banda, també hauria de tenir fàcil accés les diferents pàgines on es poguessin trobar les fotos segons el lloc o temàtica.",

    "how-laphoto-1": "Pel que fa al procés, el primer que he fet va ser reunir-me amb ell i crear un esbós de com li agradaria que sigui la pàgina, mirant i comparant diferents portfolis i pàgines d'altres fotògrafs. A partir d'aquí, he hagut d'investigar pel meu compte sobre el funcionament de WordPress i dels seus diferents plugins, ja que no disposava de coneixements previs. El que va cobrir de manera més eficaç les meves necessitats va ser Elementor, juntament amb Essential Addons for Elementor.",
    "how-laphoto-2": "Un cop creada l'estructura bàsica de la pàgina, he creat un estil predeterminat gràcies al Theme Builder inclòs a Elementor per no haver de fer els canvis d'estil per a cada component.",
    "how-laphoto-3": "El pas següent va ser crear i desar un template dels components que es repetirien en més d'una pàgina (header, footer i algunes galeries). A partir d'aquí he anat afegint les diferents seccions i pàgines fins a l'estat actual.",
    "how-laphoto-4": "A mesura que he anat avançant amb el projecte, sempre he anat mirant i revisant com es comportava la pàgina a diferents dispositius, fent modificacions des d'Elementor perquè el resultat sigui el més òptim possible.",
    "how-laphoto-5": "Finalment, he afegit la possibilitat de canviar d'idioma, en principi només dos (anglès i espanyol), per a la qual he fet servir el plugin TranslatePress - Multilingual. Aquest complement permet tant deixar traduccions automàtiques com fer traduccions manuals, que era el que en aquest cas m'interessava més.",
    "how-laphoto-6": "Pots donar un cop d'ull a la pàgina fent click al següent enllaç: ",

    "my-portfolio": "El Meu Portfolio",
    "how-portfolio-1": "Este proyecto lo creé para continuar aprendiendo, poner en práctica conocimientos adquiridos y también para tener una plataforma en donde pudiera enseñar mis trabajos y proyectos.",
    "how-portfolio-2": "He utilizado como base un template de W3Schools hecho en HTML y lo primero que hice fue pasar los fragmentos que me interesaban de ese HTML a componentes de React utilizando JavaScript. Luego he ido modificándolos y adaptándolos a gusto con la ayuda de CSS, Bootstrap y Media Queries para lograr que sea lo más responsivo posible. Por último, he creado los componentes restantes hasta tener todos los apartados que hay actualmente (Cards para los proyectos, Sobre Mi, Habilidades, Contáctame).",
    "design-portfolio": "Diseño Responsivo y Accesible",
    "design-portfolio-text": "El diseño está principalmente pensado para que sea lo más accesible posible, la web posee un 100% en accesibilidad medido utilizando la herramienta Lighthouse de Google Chrome. Para lograr esto, he evitado el uso de muchos colores y he utilizado contrastes altos entre tipografía y fondos. Por otro lado, he utilizado Georgia Serif como tipo de letra ya que es una de las tantas que favorecen la lectura. A su vez, cada imagen tiene su descripción como texto alternativo y, tanto los botones como el formulario, tienen sus respectivos aria-label indicando su función.",

    "form-portfolio": "Formulario de contacto: EmailJS",
    "form-portfolio-text": "...... estoy en ello .....",

    "func-portfolio": "Funcionalidades Agregadas",
    "func-portfolio-intro": "He creado dos funcionalidades para que el usuario tenga una mejor experiencia al visitar la página, la posibilidad de cambiar entre light y dark mode y de seleccionar el idioma (por el momento disponible para Inglés, Catalán y Español).",
    "func-portfolio-text-1": "He elegido hacer el cambio de un theme al otro mediante una función que agregue un tipo de clase específico al componente body (className=”dark”) y utilizar CSS para aplicar los cambios en el estilo (.dark).",
    "func-portfolio-text-2": "¿Cómo funciona? Al hacer click en el botón y pasar del Light al Dark Mode, este theme se aplica como nombre de clase al elemento body del HTML, por lo que el className del body será “dark”. CSS verá este cambio en la clase de body, y aplicará los estilos correspondientes con la transición indicada. Al volver a hacer click, la clase “dark” se eliminará y volverá a su estado anterior con sus respectivos estilos.",
    "func-portfolio-text-3": "Para poder acceder a esta información, saber cuál es el theme actual, y a partir de ahí poder actualizarlo, he utilizado los hooks useEffect y useState.",

    "lang-select-portfolio": "Selección de Idiomas",
    "lang-select-portfolio-text": "...... estoy en ello ..... He usado i18next."
}